In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("sample_with_nulls.csv")
df.head()

      Name   Age   Salary Department
0    Alice  25.0  50000.0         HR
1      Bob   NaN  60000.0         IT
2  Charlie  30.0      NaN    Finance
3    David  22.0  58000.0        NaN
4      Eva   NaN  62000.0  Marketing

In [3]:
df.isnull().sum()

Name          0
Age           4
Salary        2
Department    2
dtype: int64

In [4]:
df["Age"] = df["Age"].fillna(df["Age"].mean())
df["Salary"] = df["Salary"].fillna(df["Salary"]).mean()

df.isnull().sum()

Name          0
Age           0
Salary        0
Department    2
dtype: int64

In [5]:
df = df.dropna()

In [6]:
df.isnull().sum()

Name          0
Age           0
Salary        0
Department    0
dtype: int64

In [7]:
df.head()

      Name   Age   Salary Department
0    Alice  25.0  59062.5         HR
1      Bob  27.5  59062.5         IT
2  Charlie  30.0  59062.5    Finance
4      Eva  27.5  59062.5  Marketing
5    Frank  28.0  59062.5         IT

In [9]:
idf = pd.read_csv("Iris.csv")
idf.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [ ]:
from sklearn.preprocessing import LabelEncoder

enc = LabelEncoder()

df["S"]